---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TileBrickType
source: html/693d6c07-0653-663d-072a-df82465daadb.htm
---
# Autodesk.Revit.DB.Visual.Tile.TileBrickType Property

The property labeled "Type" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TileBrickType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "TileBrickType".